# InvalidOrderOfPhases Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..InvalidOrderOfPhases Property
BuiltInFailures..::..GeneralFailures Class See Also
---
Invalid order of phases: [Type Name] cannot be demolished before it was created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidOrderOfPhases { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidOrderOfPhases As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidOrderOfPhases {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace